


#Область ПрограммныйИнтерфейс  
// {{Бозов. Е.А.: Доработка по заданию


Процедура ДополнитьФорму(Форма) Экспорт 
	
	ИмяФормы = форма.ИмяФормы;
	
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппашапкаПраво(Форма);  
		ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаПраво(Форма);
		ДобавитьКнопкуВГруппаШапкаПраво(форма);
		
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма); 
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаформуПередОснование(Форма); 
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма); 
		
	КонецЕсли; 
	
КонецПроцедуры

// }}
#Конецобласти 


#Область СлужебныеПроцедурыИФункции     
// {{Бозов. Е.А.: Доработка по заданию

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("Полеформы"), Форма.Элементы.ГруппаШапкаПраво); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДД_КонтактноеЛицо";       
	
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить ("КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.Основание); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДД_КонтактноеЛицо"; 
	
КонецПроцедуры  

Процедура ВставитьПолеКонтактноеЛицоНаформуПередСуммаДокумента(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить ("КонтактноеЛицо", Тип("Полеформы"),, Форма.Элементы.СуммаДокумента); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДД_КонтактноеЛицо"; 
	
КонецПроцедуры 


Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаПраво(Форма) 
	
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("Полеформы"), Форма.Элементы.ГруппаШапкаПраво); 
	ПолеВвода.Вид = ВидПоляформы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДД_СогласованнаяСкидка";       
	
	ПолеВвода.УстановитьДействие("ПриИзменении", "ДД_СогласованнаяСкидкаПриИзменении");
	
КонецПроцедуры	

Процедура ДобавитьКнопкуВГруппаШапкаПраво(Форма) 
	
	Команда = Форма.Команды.Добавить("ДД_ПересчитатьТаблицу");
	Команда.Действие = "ДД_ПересчитатьТаблицу";
	Команда.Заголовок = "Пересчитать таблицу";
	Кнопка = Форма.Элементы.Добавить("ДД_ПересчитатьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаПраво);
	Кнопка.ИмяКоманды = "ДД_ПересчитатьТаблицу";
	Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;       
	
КонецПроцедуры 

// }}

#КонецОбласти        

